Repository: diegodlh/jamulus-es
Catalog: Recursos_OmegaT/jamulus-omegat.tmx
Source language: en_gb
Languages: es_es

source: Normally, network address translation (NAT) firewalls prevent incoming requests initiated from outside the local network. Inbound traffic is only possible for packets relating to an outbound request (strictly speaking, "related" and "established" packets to an initial outbound connection). In public mode, when your Jamulus server connects to a Central Server it of course initiates an outbound connection. From then on, the Central Server sends (established/related) connection "pings" (not ICMP pings) to your server at regular intervals to keep the relevant NAT port(s) open on your router/firewall.
es_es: Normalmente, los cortafuegos NAT impiden las peticiones externas desde fuera de la red local. El tráfico entrante solo es posible para paquetes relacionados con una petición saliente (estrictamente hablando, paquetes de "relación" y "establecimiento" con una conexión inicial saliente). En modo público, cuando un servidor Jamulus se conecta a un Servidor Central, inicia una conexión saliente. De ahí en adelante, el Servidor Central envía "pings" de conexión (establecimiento/relación; no pings ICMP) a ese servidor a intervalos regulares para mantener abierto(s) el/los puerto(s) relevantes en el router/cortafuegos.

source: However, in private mode clients have to initiate connections into the server's network. NAT firewalls prevent this, so you need to tell them to allow incoming connection requests on the Jamulus port using port forwarding.
es_es: Sin embargo, en modo privado los clientes tienen que iniciar conexiones a la red del servidor. Los cortafuegos NAT impiden esto, por lo que tienes que decirles que permitan peticiones de conexión entrantes en el puerto que Jamulus utiliza, mediate la validación de puertos.

source: Please ensure you have read the server overview
es_es: Primero asegúrate de leer la descripción de servidores

source: This guide assumes you will be running a private server on your home network, but some of the issues here may also apply to those running on cloud hosts (eg Amazon EC2).
es_es: Esta guía presupone que vas a ejecutar un servidor privado en tu red doméstica, pero algunos de los problemas de aquí también podrían ser aplicables a aquellos ejecutándolo en hosts en la nube (por ej. Amazon EC2).

source: It is also highly recommended to test your server in public mode first so as to narrow down any subsequent problems in private mode.
es_es: Se recomienda que pruebes a ejecutar tu servidor en modo público primero para así acotar cualquier problema posterior en modo provado.

source: Operating a private server behind a home network router
es_es: Operar un servidor privado tras un router doméstico

source: Port forwarding
es_es: Validación de puertos

source: (If you are curious about why you need to do this for private but not public servers, see this footnote.)
es_es: (Si tienes curiosidad sobre por qué hay que hacer esto para los servidores privados pero no para los públicos, consulta esta nota.)

source: Normally, people from outside your home network cannot see things inside it. So if you want to operate a Jamulus server at home, you need to open a hole in your router to let Jamulus clients connect to it.
es_es: Normalmente, las personas de fuera de tu red doméstica no pueden ver lo que sucede dentro de ella. Por tanto, si quieres operar un servidor Jamulus en casa, tienes que abrir una puerta en tu router para dejar que clientes de Jamulus puedan conectarse a él.

source: The default port for the current version of the Jamulus software is UDP (not TCP) port 22124.
es_es: El puerto por defecto para la versión actual del software Jamulus es el puerto UDP (no TCP) 22124.

source: Many people attribute problems to the server that are in fact problems with the client. Much depends on the clients' hardware, the networks that they are on, and whether they are sticking to Rule Number One. There is therefore no guarantee that you will achieve lower latency or better overall performance by having your own server.
es_es: Mucha gente atribuye problemas al servidor que en realidad son problemas con el cliente. Mucho depende del hardware del cliente, las redes en las que operan, y su adherencia a la Regla Número Uno. Por tanto, no hay ninguna garantía de que conseguirás una latencia más baja o un rendimiento superior ejecutando tu propio servidor.

source: If you plan to be playing regularly with the same people, you are strongly advised to first make sure that each member of the group is set up to use Jamulus properly. Do this by finding a public server with a reasonable ping time for all of you (20ms or less perhaps), all connect to that and work to fix any individual issues (verifying that they can follow Rule Number One in particular). Use the solo technique above to prevent being interrupted if needed.
es_es: Si tienes intención de tocar regularmente con las mismas personas, se recomienda encarecidamente que primero os aseguréis de que cada miembro del grupo tiene la configuración adecuada para utilizar Jamulus. Haz esto buscando un servidor público con un tiempo de ping razonablemente bajo para todos (20ms o menos quizá), os conectáis todos allí y trabajáis para solucionar cualquier problema individual (verificando que pueden seguir la Regla Número Uno en particular). Utiliza la técnica descrita arriba de usar el botón de "solo" para impedir interrupciones si es necesario.

source: Once any issues with musicians have been solved in this way, you can then investigate hosting your own server either at home or on a cloud host such as Amazon, which may result in better latency than servers run at home. For example, see this guide to using AWS Lightsail by Jamulus user Simon Tomlinson (Facebook)
es_es: Una vez se haya solucionado cualquier problema que puedan tener los músicos, ahora puedes investigar sobre cómo ejecutar tu propio servidor en casa o en un host en la nube como Amazon, que puede resultar en una major latencia que con servidores ejecutados en casa. Por ejemplo, ver esta guía para utilizar AWS Lightsail por parte del usuario de Jamulus Simon Tomlinson (Facebook)

source: Bandwidth - do you have enough?
es_es: Ancho de banda - ¿tienes suficiente?

source: A typical jam might have 4 people, for which you would need 200Kbps * 4 = 800Kbs (0.8Mbps) up and down. So if you have a 10Mbits down and 1Mbps up broadband connection, you may start running out of bandwidth if a fifth player joins, particularly if other musicians choose settings that increase their usage. You may want to check that you have enough speed for that. Read more about bandwidth use at different quality settings.
es_es: En una jam típica puede haber 4 personas, para lo que necesitarías 200Kbps * 4 = 800Kbs (0,8Mbps) de subida y bajada. Así que si tienes 10Mbits de bajada y 1Mbps de subida de banda ancha, puede ser que te empiece a escasear el ancho de banda si se une una quinta persona, sobre todo si otros músicos eligen configuraciones que aumentan su uso. Quizá quieras comprobar que tienes velocidad suficiente para ello. Lee más sobre el uso de ancho de banda con diferentes configuraciones de calidad.

source: In general
es_es: En general

source: Consider using a cloud host to get better ping times if you having problems
es_es: Considera el uso de un host en la nube para conseguir mejores tiempos de ping si tienes problemas

source: Any server should have at least 1.6GHz CPU frequency and 1GB RAM
es_es: Cualquier servidor debería de tener una frecuencia de procesador de 1,6GHz CPU y 1GB de RAM

source: Running a server may require you to adjust any firewalls running on or outside of your machine or cloud host.
es_es: Ejecutar un servidor puede requerir que configures cortafuegos operando en tu ordenador o host en la nube, o externos.

source: Running a private server at home (but not a public one) will require you to port forward on your router.
es_es: Ejecutar un servidor privado en casa (pero no uno público) requerirá que valides puertos en tu router.

source: Home \> Running a Server
es_es: Inicio \> Ejecutar un Servidor

source: Jamulus doesn't currently support IPv6
es_es: Actualmente Jamulus no da soporte para IPv6

source: All OK? Get set up!
es_es: ¿Todo bien? ¡A configurar!

source: For Windows or Macintosh users
es_es: Para usuarios de Windows o Macintosh

source: For Raspberry Pi
es_es: Para Raspberry Pi

source: Server operators may also be interested in downloading this set of useful tools from the Jamulus repository (clone the Git repo and also call git submodule update --init).
es_es: Los operadores de servidores también pueden descargarse este conjunto de herramientas útiles del repositorio de Jamulus (clona el repositorio de Git y ejecuta git submodule update --init).

source: Having problems? Got issues?
es_es: ¿Experimentando problemas?

source: See the Server Troubleshooting FAQ
es_es: Consulta el FAQ de Resolución de Problemas con el Servidor

source: Do I need to run a server to use Jamulus?
es_es: ¿Necesito ejecutar un servidor para utilizar Jamulus?

source: Not if you don't want to. You can just choose somebody else's server from your list and get going.
es_es: No, si no quieres. Puedes simplemente escoger otro servidor de la lista y utilizarlo.

source: Don't want strangers interrupting? Once you and your friends are connected to a public server, press the "solo" buttons on the musicians each of you want to play with. Anyone you don't solo will see a "muted" icon on your channel. And you won't hear them.
es_es: ¿No quieres interrupciones de extraños? Una vez que tú y tus compañeros/as se hayan conectado a un servidor público, pulsa el botón de "solo" de cada músico con quien quieres tocar. Aquellos para quienes no actives este botón verán un icono de "muteado" en tu canal. Y no les escucharás.

source: That sounds too easy. I REALLY want to run one - what do I need to know?
es_es: Eso suena demasiado fácil. QUIERO operar el mío propio - ¿qué necesito saber?

source: Server types
es_es: Tipos de servidor

source: It's very important that you read and understand what type of server you want to run. Please read the overview on Server Types then come back here.
es_es: Es muy importante que leas y entiendas qué tipo de servidor quieres utilizar. Por favor consulta la descripción de Tipos de Servidor y luego vuelve aquí.

source: Speed and latency
es_es: Velocidad y latencia

source: The capability of the server itself (and the network it's on) is NOT the main determinant of the quality of a Jamulus session!
es_es: La capacidad del servidor en sí (y de la red en la que opera) NO es el factor más determinante para la calidad de una sesión con Jamulus

source: Running a "headless" server
es_es: Ejecutar un servidor "headless"

source: The following guide is for running Jamulus as a "pure" server on hardware without audio (eg on a 3rd party/cloud host) and assumes Ubuntu/Debian distributions using systemd. We also have instructions for Raspberry Pi, which rock too.
es_es: La siguiente guía es para ejecutar Jamulus como un servidor "puro" en hardware sin audio (por ej. en una máquina externa/host en la nube) y presupone el uso de distribuciones Ubuntu/Debian utilizando systemd. También tenemos instrucciones para Raspberry Pi, que va genial.

source: Jamulus user Grigory maintains a Docker image for Jamulus which you can use.
es_es: El usuario de Jamulus Grigory mantiene una imagen de Docker para Jamulus que puedes utilizar.

source: Jamulus user skrul has also put up some public Amazon EC2 AMIs of Ubuntu 18.04 running Jamulus. See this page for details.
es_es: El usuario de Jamulus skrul también tiene disponibles algunas AMI públicas de Amazon EC2 de Ubuntu 18.04 ejecutando Jamulus. Ver esta página para más detalles.

source: Compile sources, create a user
es_es: Compila las fuentes, crea un usuario

source: Get the sources, install the dependent packages according to the Linux client install guide. Note that you don't need to install the Jack package(s) for a headless build. If you plan to run headless on Gentoo, or are compiling under Ubuntu for use on another Ubuntu machine, see the footnote.
es_es: Obtén las fuentes e instala las dependencias de acuerdo a la guía de instalación de Linux. Ten en cuenta que no necesitas instalar los paquetes de JACK para una instalación 'headless'. Si tienes pensado ejecutar un servidor 'headless' en Gentoo, o estás compilando en Ubuntu para usarlo en otra máquina con Ubuntu, ver la nota a pie de página.

source: Compile the sources to ignore the Jack sound library:
es_es: Compila las fuentes para ignorar la librería de sonido de Jack:

source: Move the resulting Jamulus binary file to a permanent location, or use sudo make install. You can now remove the sources directory if you wish.
es_es: Mueve el archivo binario resultante de Jamulus a una ubicación permanente, o utiliza sudo make install. Ahora puedes eliminar la carpeta de las fuentes si quieres.

source: The rest of this guide assumes you are using /usr/local/bin/Jamulus
es_es: El resto de esta guía presupone que estás utilizando /usr/local/bin/Jamulus

source: Home \> Running a Server \> Installing on Linux
es_es: Inicio \> Ejecutar un Servidor \> Instalación en Linux

source: Create a non-privileged system user for the server to run as (will run as user jamulus, group nogroup):
es_es: Crea un usuario de sistema sin privilegios para ejecutar el servidor (se ejecutará como usuario jamulus, grupo nogroup):

source: Create a start script
es_es: Crea un script de arranque

source: Once you have decided which mode you want your server to run in, use systemd to start it up (the rest of this guide assumes you are in "public" mode - Please also see this important note on Central Servers).
es_es: Una vez que has decidido en qué modo quieres ejecutar tu servidor, usa systemd para arrancarlo (el resto de esta guía presupone que lo harás en modo "público" - Lee también esta nota importante sobre Servidores Centrales).

source: Create a systemd unit file that will start the server at boot time (thanks to David Harrold for this).
es_es: Crea un archivo de unidad de systemd, que iniciará el servidor al arrancar el ordenador (gracias a David Harrold por esto).

source: The unit file applies high priority CPU and I/O scheduling to the server process. This is optional (and may be ignored on some hosts).
es_es: El archivo de unidad aplica una prioridad alta al CPU y al I/O scheduling para el proceso del servidor (y puede ser ignorado en algunos hosts).

source: Note also that the server log entries will go to journalctl (use journald to see it ).
es_es: Ten en cuenta también que las entradas de registro del servidor irán a journalctl (utiliza journald para verlos).

source: Copy the unit file to /etc/systemd/system and give it permissions:
es_es: Copia el archivo a /etc/systemd/system y dale permisos:

source: Test that it starts OK:
es_es: Prueba que arranca bien:

source: You should see something like this:
es_es: Deberías de ver algo así:

source: If all is well, enable the service to start at boot with:
es_es: Si todo ha ido bien, activa el inicio del servicio al arrancar con:

source: You can now also control Jamulus with the service command. For example:
es_es: Ahora también puedes controlar Jamulus con el comando de service. Por ejemplo:

source: Running a server with the GUI
es_es: Ejecutar el servidor con interfaz gráfica

source: shows whether Jamulus is running OK, and the last few lines of the log (where you will see connections recorded). Note: Press q to exit the service status.
es_es: muestra si Jamulus se está ejecutando bien, y las últimas líneas del registro (donde verás un registro de las conexiones). Nota: Pulsa q para salir del estado del servicio.

source: Download the new sources as per the instructions above and repeat the compilation in step 2 as if for a new installation. Shut down the server, copy the Jamulus binary over the old one and start it back up.
es_es: Descarga las fuentes siguiendo las instrucciones anteriores y repite el proceso de compilación del paso 2 como si fuera una nueva instalación. Cierra el servidor, copia el archivo binario de Jamulus encima del antiguo y reinicialo.

source: Footnotes
es_es: Notas

source: Controlling recordings
es_es: Controlar las grabaciones

source: If you plan on recording jam sessions with the -R command line option, you can toggle the recording function on/off, or make a new recording directory while the server is running using the following unit files (your system will need to be using systemd).
es_es: Si tienes pensado grabar las jam session con la opción -R de la línea de comandos, puedes conmutar la función de grabación entre on/off, o crear un nuevo directorio de grabación mientras se ejecuta el servidor utilizando los siguientes archivos de unidad (tu sistema tendrá que usar systemd).

source: Simply create the following two .service files in /etc/systemd/system, calling them something appropriate (eg newRecording-Jamulus-server.service).
es_es: Simplemente crea los siguientes dos archivos .service en /etc/systemd/system, dándoles un nombre apropiado (eg nuevaGrabación-Jamulus-server.service).

source: For turning recording on or off (depending on the current state):
es_es: Para encender o apagar la grabación (dependiendo del estado actual):

source: If you plan to run a server on your desktop machine (and you have installed the Jamulus client already), you can run it in your chosen server mode by running Jamulus with the -s option as follows:
es_es: Si tienes pensado ejecutar un servidor en tu ordenador (y ya has instalado el cliente de Jamulus), lo puedes hacer en el modo de servidor que desees ejecutando Jamulus con la opción -s como sigue:

source: For starting a new recording:
es_es: Para empezar una nueva grabación:

source: [Unit] Description=Start a new recording on Jamulus server Requisite=Jamulus-Server [Service] Type=oneshot ExecStart=/bin/systemctl kill -s SIGUSR1 Jamulus-Server
es_es: [Unit] Description=Toggle recording state of Jamulus server Requisite=Jamulus-Server [Service] Type=oneshot ExecStart=/bin/systemctl kill -s SIGUSR2 Jamulus-Server

source: Note: The Jamulus service name in the ExecStart line needs to be the same as the .service file name you created when setting systemd to control your Jamulus server. So in this example it would be Jamulus-Server.service
es_es: Nota: El nombre del servicio Jamulus en la línea de ExecStart tiene que ser el mismo que el nombre del archivo .service que creaste cuando configuraste systemd para controlar tu servidor Jamulus. Así que en este ejemplo sería Jamulus-Server.service

source: Run sudo systemctl daemon-reload to register them for first use.
es_es: Ejecuta sudo systemctl daemon-reload para registrarlos para su primer uso.

source: Now you can run these with the service start command, for example:
es_es: Ahora puedes ejecutarlos con el comando service start, por ejemplo:

source: sudo service jamulusTogglerec start (assuming you named your unit file jamulusTogglerec.service)
es_es: sudo service jamulusTogglerec start (suponiendo que has nombrado tu archivo de unidad jamulusTogglerec.service)

source: You can see the result of these commands if you run service jamulus status, or by viewing the logs.
es_es: Puedes ver el resultado de estos comandos si ejecutas service jamulus status, o viendo los registros.

source: Note: When your server is recording, clients will display a message that recording is on.
es_es: Nota: Cuando tu servidor está grabando, los clientes mostrarán un mensaje informando de que la grabación está activa.

source: Viewing The Logs
es_es: Ver los Registros

source: Jamulus will log to the system file if you left the StandardOutput=journal setting in the unit file. Logging to the system log is recommended, as the system will manage the log file for you, no need to come back and purge it later, or worry about filling up your disk space.
es_es: Jamulus dejará registros en el archivo del sistema si dejaste la configuración StandardOutput=journal en el archivo de unidad. Se recomienda dejar registros en el registro del sistema, ya que el sistema gestionará el archivo de registro por tí, sin necesidad de volver luego para purgarlo, o preocuparte por llenar espacio en el disco.

source: Open a terminal window (CTRL+ALT+t on Ubuntu and related distros).
es_es: Abre una terminal (CTRL+ALT+t en Ubuntu y distros relacionadas).

source: To view the log, use journalctl (to exit press Ctrl-C). For example, to read the system log file, filtered for the Jamulus service:
es_es: Para ver el registro, utiliza journalctl (para salir pulsa Ctrl-C). Por ejemplo, para leer el archivo de registro del sistema, filtrado para el servicio Jamulus:

source: For today’s entries:
es_es: Para los registros de hoy:

source: For the last hour:
es_es: Para la última hora:

source: Filter the log to see connection messages for your Jamulus server:
es_es: Filtrar el registro para ver mensajes de conexión de tu servidor Jamulus:

source: Follow (show on screen) Jamulus log messages as they occur:
es_es: Mostrar (en pantalla) mensajes de registro de Jamulus según ocurren:

source: Assuming Jamulus is in /usr/local/bin, type Jamulus -s
es_es: Suponiendo que Jamulus se encuentra en /usr/local/bin, teclea Jamulus -s

source: What does the "headless" build flag do?
es_es: ¿Qué hace el indicador de compilación "headless"?

source: Although not strictly necessary, we recommend using the headless flag to speed up the build process. Gentoo users may also be able to avoid installing some dependencies as a consequence. More information here.
es_es: Aunque no es estrictamente necesario, recomendamos utilizar el indicador headless para agilizar el proceso de compilación. Los usuarios de Gentoo también pueden evitar la instalación de algunas dependencias como consecuencia de esto. Más información aquí.

source: Hit return and you should see the server control window. You can stop the server by closing the server window, or by typing CTRL+C in the terminal.
es_es: Dale a Enter y deberías ver la ventana del servidor. Puedes detener el servidor cerrando la ventana o tecleando CTRL+C en la terminal.

source: To configure the server, please refer to the Windows & Macintosh instructions.
es_es: Para configurar el servidor, por favor consulta las instrucciones para Windows y Macintosh.

source: Hit return to start the server. It automatically registers at the official central server. Just type in the name, city and country so that other users can easily identify you. Please also see this important note on Central Servers.
es_es: Pulsa Enter para arrancar el servidor. Se registra automáticamente en el servidor central oficial. Simplemente escribe el nombre, la ciudad y el país para que otros usuarios puedan identificarte con facilidad. También lee esta nota importante sobre los servidores centrales.

source: You can stop the server by quitting the server window, or by typing CTRL+C in the Terminal.
es_es: Puedes parar el servidor cerrando su ventana o pulsando CTRL+C en la Terminal.

source: If you want to run a client on the same machine, FIRST start Jamulus as you would normally (it will be in client mode). THEN start your server as above. Note that you should connect the client to 127.0.0.1 in this case for best performance.
es_es: Si quieres ejecutar un cliente en la misma máquina, PRIMERO arranca Jamulus como lo harías normalmente (estará en modo cliente). ENTONCES arranca tu servidor como se indica arriba. Ten en cuenta que en este caso deberás conectar el cliente a la dirección 127.0.0.1 para un mejor rendimiento.

source: Home \> Running a Server \> Installing on Mac
es_es: Inicio \> Ejecutar un Servidor \> Instalación en Mac
